# PropertySetMaterialAspect Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..PropertySetMaterialAspect Property
ParameterTypeId Class See Also
---
"Material aspect"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId PropertySetMaterialAspect { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property PropertySetMaterialAspect As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ PropertySetMaterialAspect {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace